---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyReference
source: html/9dd426b6-0997-319d-14a7-f044ac7b4272.htm
---
# AssetPropertyReference Members

Adds a new connected asset attached to this asset property, if it allows it.